In [1]:
import pandas as pd

# 문제1. user_id를 인덱스로 사용한 데이터프레임 읽기

- occupation.tsv

In [4]:
df = pd.read_csv("./data/occupation.tsv", sep = "|", index_col = "user_id")

# 문제2. 상위 25개 행 확인

In [7]:
df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

# 문제3. 하위 10개 행 확인

In [9]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# 문제4. 데이터의 행 수 확인

In [11]:
df.shape[0]

943

In [15]:
len(df)

943

# 문제5. 컬럼 수 확인

In [17]:
df.shape[1]

4

In [19]:
len(df.columns)

4

# 문제6. 컬럼명 확인

In [21]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# 문제7. 데이터 인덱스 확인

In [24]:
df.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

# 문제8. 각 컬럼의 자료형 확인

In [26]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# 문제9. occupation 컬럼 추출

In [28]:
df["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# 문제10. occupation 컬럼의 고유값 수 확인

In [30]:
df["occupation"].value_counts().count()

21

In [32]:
len(df["occupation"].value_counts())

21

In [34]:
len(df["occupation"].unique())

21

In [36]:
df["occupation"].nunique()

21

# 문제11. occupation 컬럼의 최빈값 확인

In [38]:
df["occupation"].value_counts().index[0]

'student'

# 문제12. 수치형 컬럼의 기술 통계 확인

In [40]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

# 문제13. 모든 컬럼의 기술 통계 확인

In [42]:
df.describe(include = "all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

# 문제14. occupation 컬럼의 기술 통계 확인

In [44]:
df["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# 문제15. age컬럼의 평균 구하기

- 단, 소수점 이하는 반올림

In [48]:
round(df["age"].mean())

34

# 문제16. age컬럼에서 빈도가 가장 낮은 고유값 5개 확인

In [50]:
df["age"].value_counts().tail().index

Index([7, 66, 11, 10, 73], dtype='int64', name='age')